[
    {
        "Description": "Undercover -- Unveil this identity only if another player has four or fewer cards in hand.\n\nWhen The Augur is unveiled, shuffle your library, scry X, then reveal the top card of your library. You may play that card without paying its mana cost.",
        "Role": "Guardian",
        "Name": "The Augur",
        "Rarity": "Rare",
        "Unveil Cost": "{X}{2}"
    },
    {
        "Description": "When The War Shaman is unveiled, destroy up to two target noncreature permanents. If it's your turn, create an X/X red Elemental creature token, where X is the total mana value of the permanents destroyed this way.",
        "Role": "Assassin",
        "Name": "The War Shaman",
        "Rarity": "Rare",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "Undercover -- Unveil this identity only if another player controls ten or more permanents.\n\nWhen The Cyromancer is unveiled, tap X target permanents. If it's your turn, those permanents don't untap during their controller's next untap step.",
        "Role": "Guardian",
        "Name": "The Cyromancer",
        "Rarity": "Rare",
        "Unveil Cost": "{X}{2}"
    },
    {
        "Description": "When The Gatekeeper is unveiled, create Cerberus, a legendary 4/8 black and red Hound creature with menace, double strike, trample, and lifelink.\n\n{2}: Turn The Gatekeeper face down.",
        "Role": "Traitor",
        "Name": "The Gatekeeper",
        "Rarity": "Uncommon",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "When The Pyromancer is unveiled, it deals 6 damage to target player and each creature and planeswalker they control. If a creature is dealt damage this way, it loses indestructible until end of turn.",
        "Role": "Assassin",
        "Name": "The Pyromancer",
        "Rarity": "Uncommon",
        "Unveil Cost": "{7}"
    },
    {
        "Description": "When The Bio-Engineer is unveiled, you get six nut counters.\n\n{2}, Pay one nut counter: Put a +1/+1 counter on target creature. That creature becomes an artifact in addition to its other types.\n\n{3}, Pay two nut counters: Gain control of target artifact.",
        "Role": "Assassin",
        "Name": "The Bio-Engineer",
        "Rarity": "Mythic",
        "Unveil Cost": "Sacrifice a nonland permanent."
    },
    {
        "Description": "When The Seer is unveiled, choose any target, shuffle your library, then scry X. Reveal the top card of your library and put it into your hand. The Seer deals damage equal to twice that card's mana value to that permanent or player.",
        "Role": "Assassin",
        "Name": "The Seer",
        "Rarity": "Uncommon",
        "Unveil Cost": "{X}"
    },
    {
        "Description": "When The Demon is revealed, search your library for a card, put that card into your hand, then shuffle.",
        "Role": "Assassin",
        "Name": "The Demon",
        "Rarity": "Uncommon",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "When The Grenadier is unveiled, create X colorless artifact tokens named Explosive with \"{2}, {⤵}, Sacrifice this artifact: Destroy target nonland permanent. Its controller loses 2 life.\"",
        "Role": "Traitor",
        "Name": "The Grenadier",
        "Rarity": "Uncommon",
        "Unveil Cost": "{X}"
    },
    {
        "Description": "Start the game with a number of purification counters on The Queen of Light equal to half the number of players, rounded down.\n\n{3}, Remove a purification counter from The Queen of Light: Exile a permanent of your choice. (This ability doesn't target anything. You choose a permanent as it resolves.)",
        "Role": "Leader",
        "Name": "The Queen of Light",
        "Rarity": "Uncommon",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When The Corpse Snatcher is unveiled, each player mills two cards. Put a creature card from a graveyard onto the battlefield under target player's control. That creature is a black Zombie in addition to its other colors and types.",
        "Role": "Assassin",
        "Name": "The Corpse Snatcher",
        "Rarity": "Rare",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "As The Wearer of Masks is unveiled, choose four Traitor identity cards at random from outside the game. You may pay the unveil cost of one of those cards. If you do, until The Wearer of Masks is turned face down, it becomes a copy of that identity. If you don't, turn The Wearer of Masks face down at the beginning of your next end step.",
        "Role": "Traitor",
        "Name": "The Wearer of Masks",
        "Rarity": "Mythic",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When The Beastmaster is unveiled, choose up to two target players. Each player selected this way creates two 4/4 green Beast creature tokens.",
        "Role": "Assassin",
        "Name": "The Beastmaster",
        "Rarity": "Uncommon",
        "Unveil Cost": "{5}"
    },
    {
        "Description": "When The Witch is unveiled, choose any number of target opponents. They each reveal their hand. For each of those players, you may choose a nonland card from their graveyard or hand and exile it.",
        "Role": "Assassin",
        "Name": "The Witch",
        "Rarity": "Rare",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "Start the game with a number of void counters on The Void Tyrant equal to half the number of players, rounded down.\n\n{3}, Remove a void counter from The Void Tyrant: Counter target spell or ability from a nonidentity source. (Mana abilities can't be targeted.)",
        "Role": "Leader",
        "Name": "The Void Tyrant",
        "Rarity": "Rare",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When The Metamorph is unveiled, until end of turn, as an opponent loses the game, you may put The Metamorph outside the game. If you do, gain control of that player's identity card and turn it face down.",
        "Role": "Traitor",
        "Name": "The Metamorph",
        "Rarity": "Mythic",
        "Unveil Cost": "Pay 8 Life, Discard a card."
    },
    {
        "Description": "Undercover -- Unveil this identity only if another player attacked you or a Leader player this game.\n\nWhen The Summoner is unveiled, target player creates X Y/Y green Elemental Beast creature tokens.",
        "Role": "Guardian",
        "Name": "The Summoner",
        "Rarity": "Rare",
        "Unveil Cost": "{X}{Y}{1}"
    },
    {
        "Description": "At the beginning of your upkeep, roll a six-sided die. The ability has the indicated effect.\n1 -- Do nothing.\n2 -- Scry 1.\n3 -- You gain 3 life.\n4 -- Create a 0/1 white Goat creature token.\n5 -- Create a Treasure token.\n6 -- Repeat this process two more times.",
        "Role": "Leader",
        "Name": "The Chaos Bringer",
        "Rarity": "Uncommon",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When the Cleaner is unveiled, if it's your main phase, exile all nonland permanents you don't control.",
        "Role": "Traitor",
        "Name": "The Cleaner",
        "Rarity": "Rare",
        "Unveil Cost": "{8}"
    },
    {
        "Description": "When The Supplier is unveiled, choose one or both -- \n\n* Target player searches their library and/or graveyard for a card and puts it into their hand. If they searched their library this way, they shuffle.\n\n* Target player returns a face-up exiled card they own to their hand.",
        "Role": "Guardian",
        "Name": "The Supplier",
        "Rarity": "Rare",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "When The Puppet Master is unveiled, if its your turn, redistribute control of any number of other identity cards. Then, turn face down each of those cards that isn't a Leader. (Each opponent must control one identity card.)\n\nAt the beginning of your end step, draw a card.",
        "Role": "Traitor",
        "Name": "The Puppet Master",
        "Rarity": "Mythic",
        "Unveil Cost": "{8}"
    },
    {
        "Description": "When The Reflector is unveiled, gain control of target ability, instant or sorcery spell. You may choose new targets for it. Then copy that spell or ability for each opponent. You may choose new targets for the copies.",
        "Role": "Traitor",
        "Name": "The Reflector",
        "Rarity": "Rare",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "When The Depths Caller is unveiled, choose a permanent type. Search your library for a card of the chosen type with mana value no more than X plus the number of permanents of that type you control, put it onto the battlefield, then shuffle.",
        "Role": "Assassin",
        "Name": "The Depths Caller",
        "Rarity": "Mythic",
        "Unveil Cost": "{X}{3}"
    },
    {
        "Description": "Start the game with a number of seed counters on Her Seedborn Highness equal to the number of players.\n\n{3}, Remove a seed counter from Her Seedborn Highness: Untap all permanents you control. Activate only once each turn.",
        "Role": "Leader",
        "Name": "Her Seedborn Highness",
        "Rarity": "Uncommon",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "At the beginning of your draw step, you may draw an additional card. If you do, choose a card in your hand drawn this turn. Pay 3 life or put that card on top of your library.",
        "Role": "Leader",
        "Name": "The Corrupted Regent",
        "Rarity": "Mythic",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "Undercover -- Unveil this identity only if a Leader player is the target of a spell or ability another player controls, or if they are attacked by a player other than you.\n\nWhen The Oracle is unveiled, until end of turn, Leader players have protection from everything and their life totals can't change.",
        "Role": "Guardian",
        "Name": "The Oracle",
        "Rarity": "Mythic",
        "Unveil Cost": "{2}"
    },
    {
        "Description": "When The Rebel General is unveiled, if it's your main phase, for each other player, gain control of up to one target permanent that player controls until end of turn. Untap those permanents. They gain haste until end of turn.",
        "Role": "Assassin",
        "Name": "The Rebel General",
        "Rarity": "Rare",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "When The Necromancer is unveiled, if its your turn, for each player, you may put up to one target creature card from that player's graveyard onto the battlefield under your control.",
        "Role": "Assassin",
        "Name": "The Necromancer",
        "Rarity": "Rare",
        "Unveil Cost": "{7}"
    },
    {
        "Description": "When The Ferryman is unveiled, choose target permanent. When that permanent is put into a graveyard this turn, return another target card that shares a card type with it from its owner's graveyard to the battlefield under your control.\n\n{3}: Turn The Ferryman face down. Activate only during your turn and only once each turn.",
        "Role": "Traitor",
        "Name": "The Ferryman",
        "Rarity": "Mythic",
        "Unveil Cost": "{1} "
    },
    {
        "Description": "When The Oneiromancer is unveiled, each player exiles the top X cards of their library face down.\n\nYou may look at cards exiled with The Oneiromancer, and you may cast spells among those cards without paying their mana costs. You can't cast more than one spell this way each turn.",
        "Role": "Traitor",
        "Name": "The Oneiromancer",
        "Rarity": "Uncommon",
        "Unveil Cost": "{X}{X}"
    },
    {
        "Description": "Undercover -- Unveil this identity only if another identity card has been revealed this game.\n\nWhen The Warlock is unveiled, end the phase if it isn't the ending phase.",
        "Role": "Guardian",
        "Name": "The Warlock",
        "Rarity": "Mythic",
        "Unveil Cost": "{3}"
    },
    {
        "Description": "When The Time Bender is unveiled, choose two --\n\n* Each player shuffles their hand and graveyard into their library, then draws seven cards.\n* Take an extra turn after this one.\n* End the turn.",
        "Role": "Traitor",
        "Name": "The Time Bender",
        "Rarity": "Rare",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "When The Sorceress is unveiled, you may choose new targets for target instant or sorcery spell. Then copy that spell. You may choose new targets for the copy.",
        "Role": "Assassin",
        "Name": "The Sorceress",
        "Rarity": "Uncommon",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "When The Sigil Mage is unveiled, you may cast up to two target instant or sorcery cards from graveyards without paying their mana costs.",
        "Role": "Assassin",
        "Name": "The Sigil Mage",
        "Rarity": "Uncommon",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "When the Cathar is unveiled, exile up to three target nonland permanents until you lose the game. (Those permanents return under their owners' control.)",
        "Role": "Guardian",
        "Name": "The Cathar",
        "Rarity": "Uncommon",
        "Unveil Cost": "{6}, Pay 6 life."
    },
    {
        "Description": "When The Marshal is unveiled, choose a color and a creature type. Target player creates X plus five 1/1 creature tokens of the chosen color and type. If X is three or more, destroy all other creatures.",
        "Role": "Guardian",
        "Name": "The Marshal",
        "Rarity": "Uncommon",
        "Unveil Cost": "{X}{5}"
    },
    {
        "Description": "When The Madwoman is unveiled, tap up to two target creatures. Each of those creatues deals damage equal to its power to its controller. Prevent all combat damage that would be dealt to and dealt by those creatures this turn.",
        "Role": "Assassin",
        "Name": "The Madwoman",
        "Rarity": "Rare",
        "Unveil Cost": "{5}"
    },
    {
        "Description": "When The Golem is unveiled, target Leader player loses 7 life and you gain 7 life.\n\nLeader players have hexproof and can't be attacked as long as you have 7 or more life.\n",
        "Role": "Guardian",
        "Name": "The Golem",
        "Rarity": "Uncommon",
        "Unveil Cost": "{7}"
    },
    {
        "Description": "Whenever one or more creatures an opponent controls die, you may pay {1}. If you do, choose one --\n* Create a 1/1 colorless Spirit creature token.\n* Tap or untap target nonland permanent.\n* Each opponent loses 2 life and you gain 2 life.\n* Scry 2.",
        "Role": "Leader",
        "Name": "The Blood Empress",
        "Rarity": "Uncommon",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When The Bodyguard is unveiled, until your next turn, prevent all damage that would be dealt to target player and each creature and planeswalker they control.",
        "Role": "Guardian",
        "Name": "The Bodyguard",
        "Rarity": "Uncommon",
        "Unveil Cost": "{5}"
    },
    {
        "Description": "{2}: Copy target activated or triggered ability you control. You may choose new targets for the copy. Activate only once each turn.",
        "Role": "Leader",
        "Name": "The Twin Princesses",
        "Rarity": "Rare",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "At the beginning of your upkeep, you may choose one that hasn't been chosen:\n* White -- you gain 8 life.\n* Blue -- Draw two cards.\n* Black -- Destroy target creature or planeswalker.\n* Red -- Create three 1/1 red Goblin creature tokens.\n* Green -- Destroy target artifact, enchantment, or land.",
        "Role": "Leader",
        "Name": "The Gathering",
        "Rarity": "Mythic",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When The Banisher is unveiled, exile any number of target creatures. Draw a card for each nontoken creature exiled this way.",
        "Role": "Traitor",
        "Name": "The Banisher",
        "Rarity": "Rare",
        "Unveil Cost": "{8}"
    },
    {
        "Description": "When The Shapeshifting Slayer is unveiled, if it's your main phase, choose a creature on the battlefield or a creature card in any zone other than a player's hand or library. Create a token that's a copy of it. That token gains menace, trample and haste.",
        "Role": "Assassin",
        "Name": "The Shapeshifting Slayer",
        "Rarity": "Mythic",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "When The Ambitious Queen is unveiled, counter target spell.",
        "Role": "Assassin",
        "Name": "The Ambitious Queen",
        "Rarity": "Uncommon",
        "Unveil Cost": "Pay 2 life, Exile a card from your hand."
    },
    {
        "Description": "This identity's unveil cost costs {1} less for each creature controlled by non-Leader players.\n\nWhen The Hieromancer is unveiled, tap all creatures controlled by non-Leader players. They don't untap during their controller's next untap step.",
        "Role": "Guardian",
        "Name": "The Hieromancer",
        "Rarity": "Rare",
        "Unveil Cost": "{9}"
    },
    {
        "Description": "Undercover -- Unveil this identity only if a player's life total is less than or equal to half their starting life total, or if a graveyard has seven or more cards in it.\n\nWhen The Immortal is unveiled, up to one target player gains 15 life and up to one target player shuffles their graveyard into their library.",
        "Role": "Guardian",
        "Name": "The Immortal",
        "Rarity": "Rare",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "Whenever a spell or ability destroys or exiles a nontoken permanent you control, create a Treasure token.\n\nSacrifice three Treasures: Target player draws a card.",
        "Role": "Leader",
        "Name": "The King Over the Scrapyard",
        "Rarity": "Rare",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "Undercover -- Unveil this identity only if another identity card has been unveiled or if another player attacked a Leader player this game.\n\nWhen The Great Martyr is unveiled, you gain X life and draw X cards. UNtil end of turn, if a source an opponent controls would deal life to a Leader player, that damage is dealt to you instead. The same is true for losing life, discarding cards and sacrificing permanents.",
        "Role": "Guardian",
        "Name": "The Great Martyr",
        "Rarity": "Mythic",
        "Unveil Cost": "{X}{X}{1}"
    },
    {
        "Description": "At the beginning of your upkeep, starting with the next player in turn order, each non-Leader player may choose a nonenchantment, nontoken permanent they control and draw a card. For each player who does, gain control of that permanent and untap it. If no one does, you draw a card.",
        "Role": "Leader",
        "Name": "His Beloved Majesty",
        "Rarity": "Mythic",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "Undercover -- Unveil this identity only if another player controls five or more lands.\n\nWhen The Ætherist is unveiled, counter target spell. At the beginning of target player's next main phase, they gain life and add an amount of {♢} equal to that spell's mana value.",
        "Role": "Guardian",
        "Name": "The Ætherist",
        "Rarity": "Rare",
        "Unveil Cost": "{4}"
    },
    {
        "Description": "When The Spellsnatcher is unveiled, target player gains control of target spell. They may choose new targets for it. (If that spell becomes a permanent, it enters the battlefield under that player's control.)",
        "Role": "Guardian",
        "Name": "The Spellsnatcher",
        "Rarity": "Uncommon",
        "Unveil Cost": "{6}"
    },
    {
        "Description": "Your starting life total is increased by 15.\n\nYour starting hand size and your maximum hand size are each increased by one.\n\nAt the beginning of your first upkeep, create three Treasure tokens.",
        "Role": "Leader",
        "Name": "The Old Ruler",
        "Rarity": "Uncommon",
        "Unveil Cost": "{0}"
    },
    {
        "Description": "When The Flickering Mage is unveiled, exile up to five target permanents. Return those cards to the battlefield tapped under their owner's control at the beginning of the next end step.",
        "Role": "Guardian",
        "Name": "The Flickering Mage",
        "Rarity": "Uncommon",
        "Unveil Cost": "{6}"
    }
]